## DataFrame con Pandas

In [2]:
import pandas as pd

In [3]:
#crear un dataframe con 3 columnas, nombre, edad y ciudad
data = {'Nombre': ['Juan', 'Ana', 'Pedro'],
        'Edad': [25, 30, 35],
        'Ciudad': ['Madrid', 'Barcelona', 'Valencia']}
df = pd.DataFrame(data)
# Incorporar columna salario al dataframe
df['Salario'] = [1000, 2000, 3000]
df

  Nombre  Edad     Ciudad  Salario
0   Juan    25     Madrid     1000
1    Ana    30  Barcelona     2000
2  Pedro    35   Valencia     3000

In [4]:
# Sumar 2000 a cada uno de los registros
df['Salario'] = df['Salario']+2000
df

  Nombre  Edad     Ciudad  Salario
0   Juan    25     Madrid     3000
1    Ana    30  Barcelona     4000
2  Pedro    35   Valencia     5000

In [5]:
# Edad mayor a...
mayores_25 = df[df['Edad']>25]
mayores_25

  Nombre  Edad     Ciudad  Salario
1    Ana    30  Barcelona     4000
2  Pedro    35   Valencia     5000

* Trabajar con DataFrames de Pandas 1

Crea un DataFrame llamado libros_df con la siguiente información sobre libros:

    Los títulos son: "El Quijote", "Cien años de soledad", "La odisea"

    Los autores son "Miguel de Cervantes", "Gabriel García Márquez", "Homero"

    Los años de publicación son 1605, 1967, y -800, respectivamente.

    Asegúrate de utilizar las columnas Titulo, Autor y Año.

In [6]:
libros_df = pd.DataFrame({'Titulo':["El Quijote", "Cien años de soledad", "La odisea"],
                          'Autor':["Miguel de Cervantes", "Gabriel García Márquez", "Homero"],
                          'Año':[1605,1967,-800]})

* Trabajar con DataFrames de Pandas 3

Partiendo del DataFrame df mencionado anteriormente:

    # Datos proporcionados
    data = {
        'Nombre': ['Ana', 'Luis', 'Carlos', 'Sara'],
        'Edad': [25, 30, 22, 27],
        'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Bilbao']
    }

Realiza las siguientes operaciones:

    Crea un dataframe llamado df

    Agrega una nueva columna llamada Edad_en_10_años que contenga la edad de las personas dentro de 10 años.

    Modifica la columna Ciudad para que todas las ciudades estén en mayúsculas.

    Crea una nueva columna Es_Mayor_de_25 que contenga valores booleanos: True si la persona tiene 25 años o más, y False en caso contrario.

In [13]:
    # Datos proporcionados
import pandas as pd
data = {
    'Nombre': ['Ana', 'Luis', 'Carlos', 'Sara'],
    'Edad': [25, 30, 22, 27],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Bilbao']
}
# Columna con la edad de las personas en 10 años
df = pd.DataFrame(data)
df['Edad_en_10_años'] = df['Edad']+10

# Pasar todas las ciudades a mayísculas
df['Ciudad'] = df['Ciudad'].str.upper()

# Nueva columna Booleana que indica si la persona tiene más de 25 años
df['Es_mayor_de_25'] = df['Edad']>=25
df

   Nombre  Edad     Ciudad  Edad_en_10_años  Es_mayor_de_25
0     Ana    25     MADRID               35            True
1    Luis    30  BARCELONA               40            True
2  Carlos    22   VALENCIA               32           False
3    Sara    27     BILBAO               37            True

## Ordenar y Agrupar DataFrames en Pandas

In [6]:
df = pd.read_csv("C:\\AmaruAyelen\\proyectos\\PythonDataScienceMachineLearning\\PythonDataScienceMachineLearning\\Files\\Top-Películas.csv")
df

,indice_global,indice_estricto,título,director,año,duración,género,rating,metascore,recaudación(M)
0,0,0.0,The Shawshank Redemption,Frank Darabont,1994.0,142.0,Drama,9.3,82.0,28.34
1,1,1.0,The Godfather,Francis Ford Coppola,1972.0,175.0,Crimen,9.2,100.0,134.97
2,2,1.0,The Godfather,Francis Ford Coppola,1972.0,175.0,Drama,9.2,100.0,134.97
3,3,2.0,The Dark Knight,Christopher Nolan,2008.0,152.0,Acción,9.0,84.0,534.86
4,4,2.0,The Dark Knight,Christopher Nolan,2008.0,152.0,Crimen,9.0,84.0,534.86
...,...,...,...,...,...,...,...,...,...,...
2527,2527,998.0,The Invisible Man,James Whale,1933.0,71.0,Terror,7.6,87.0,0.00
2528,2528,998.0,The Invisible Man,James Whale,1933.0,71.0,Ciencia Ficción,7.6,87.0,0.00
2529,2529,999.0,Cell 211,Daniel MonzÃ³n,2009.0,113.0,Acción,7.6,0.0,0.00
2530,2530,999.0,Cell 211,Daniel MonzÃ³n,2009.0,113.0,Crimen,7.6,0.0,0.00
2531,2531,999.0,Cell 211,Daniel MonzÃ³n,2009.0,113.0,Drama,7.6,0.0,0.00

In [8]:
# Ordenación de DataFrame con sort_values()
# Ascendente
df_ordenado = df.sort_values(by='rating')
# df_ordenado.head(10)

# Descendente
df_ordenado = df.sort_values(by='rating', ascending=False)
df_ordenado.head(10)

,indice_global,indice_estricto,título,director,año,duración,género,rating,metascore,recaudación(M)
0,0,0.0,The Shawshank Redemption,Frank Darabont,1994.0,142.0,Drama,9.3,82.0,28.34
2,2,1.0,The Godfather,Francis Ford Coppola,1972.0,175.0,Drama,9.2,100.0,134.97
1,1,1.0,The Godfather,Francis Ford Coppola,1972.0,175.0,Crimen,9.2,100.0,134.97
9,9,4.0,12 Angry Men,Sidney Lumet,1957.0,96.0,Crimen,9.0,97.0,4.36
15,15,6.0,The Godfather Part II,Francis Ford Coppola,1974.0,202.0,Drama,9.0,90.0,57.30
13,13,5.0,The Lord of the Rings: The Return of the King,Peter Jackson,2003.0,201.0,Drama,9.0,94.0,377.85
12,12,5.0,The Lord of the Rings: The Return of the King,Peter Jackson,2003.0,201.0,Aventura,9.0,94.0,377.85
11,11,5.0,The Lord of the Rings: The Return of the King,Peter Jackson,2003.0,201.0,Acción,9.0,94.0,377.85
10,10,4.0,12 Angry Men,Sidney Lumet,1957.0,96.0,Drama,9.0,97.0,4.36
14,14,6.0,The Godfather Part II,Francis Ford Coppola,1974.0,202.0,Crimen,9.0,90.0,57.30

In [9]:
# Ordenar varias columnas, se pasa como lista
df_ordenado = df.sort_values(by=['rating','recaudación(M)'], ascending=False)
df_ordenado.head(10)

,indice_global,indice_estricto,título,director,año,duración,género,rating,metascore,recaudación(M)
0,0,0.0,The Shawshank Redemption,Frank Darabont,1994.0,142.0,Drama,9.3,82.0,28.34
1,1,1.0,The Godfather,Francis Ford Coppola,1972.0,175.0,Crimen,9.2,100.0,134.97
2,2,1.0,The Godfather,Francis Ford Coppola,1972.0,175.0,Drama,9.2,100.0,134.97
3,3,2.0,The Dark Knight,Christopher Nolan,2008.0,152.0,Acción,9.0,84.0,534.86
4,4,2.0,The Dark Knight,Christopher Nolan,2008.0,152.0,Crimen,9.0,84.0,534.86
5,5,2.0,The Dark Knight,Christopher Nolan,2008.0,152.0,Drama,9.0,84.0,534.86
11,11,5.0,The Lord of the Rings: The Return of the King,Peter Jackson,2003.0,201.0,Acción,9.0,94.0,377.85
12,12,5.0,The Lord of the Rings: The Return of the King,Peter Jackson,2003.0,201.0,Aventura,9.0,94.0,377.85
13,13,5.0,The Lord of the Rings: The Return of the King,Peter Jackson,2003.0,201.0,Drama,9.0,94.0,377.85
6,6,3.0,Schindler's List,Steven Spielberg,1993.0,195.0,Biografía,9.0,95.0,96.90

Agrupamiento por categoría --> groupby

In [11]:
# This code snippet is grouping the DataFrame `df` by the column 'género' (which likely means 'gender' in Spanish) and then calculating the mean of the 'rating' column for each group. The result is a Series where the index is the unique values in the 'género' column and the values are the mean ratings for each group.
df_agrupado = df.groupby('género')['rating'].mean() # El mean saca el promedio de la columna rating
print(df_agrupado)

género
Acción             7.987255
Animación          7.943902
Aventura           7.980435
Biografía          7.971698
Ciencia Ficción    7.986567
Comedia            7.909910
Crimen             7.993500
Deportes           7.980000
Drama              7.980444
Familiar           7.932692
Fantasía           7.929508
Film-Noir          7.977273
Guerra             8.053191
Historia           7.931818
Misterio           7.991262
Musica             7.909677
Musical            7.943750
Romance            7.937398
Terror             7.875758
Thriller           7.929286
Western            8.006250
Name: rating, dtype: float64

In [12]:
# Suma de las pelis agrupadas por año
df_agrupado = df.groupby('año')['recaudación(M)'].sum()
df_agrupado.sort_values(ascending=False).head(10)

año
2014.0    8015.90
2019.0    7092.95
2010.0    6899.96
2016.0    6860.23
2015.0    6817.12
2012.0    6487.22
2009.0    6486.34
2018.0    5992.02
2008.0    5603.30
2017.0    5381.90
Name: recaudación(M), dtype: float64

* Ordenar y Agrupar DataFrames en Pandas 1

Crea un DataFrame a partir del siguiente diccionario de datos de películas.

    datos = {
        'titulo': ['Pelicula A', 'Pelicula B', 'Pelicula C', 'Pelicula D'],
        'año': [2001, 2000, 2005, 2010],
        'rating': [7.2, 6.5, 8.1, 7.5]
    }

Luego, ordena este DataFrame por la columna 'año' en orden ascendente. Asegurate de almacenar el diccionario ordenado en una variable llamada: df_ordenado

In [16]:
import pandas as pd
datos = {
    'titulo': ['Pelicula A', 'Pelicula B', 'Pelicula C', 'Pelicula D'],
    'año': [2001, 2000, 2005, 2010],
    'rating': [7.2, 6.5, 8.1, 7.5]
}

df = pd.DataFrame(datos)
df_ordenado = df.sort_values(by='año')
df_ordenado

       titulo   año  rating
1  Pelicula B  2000     6.5
0  Pelicula A  2001     7.2
2  Pelicula C  2005     8.1
3  Pelicula D  2010     7.5

* Ordenar y Agrupar DataFrames en Pandas 2

Usando el mismo DataFrame del Ejercicio anterior.

    datos = {
        'titulo': ['Pelicula A', 'Pelicula B', 'Pelicula C', 'Pelicula D'],
        'año': [2001, 2000, 2005, 2010],
        'rating': [7.2, 6.5, 8.1, 7.5]
    }

Ordena las películas primero por 'rating' en orden descendente y luego por 'año' en orden ascendente. Asegurate de almacenar el dataframe ordenado en una variable llamada: df_ordenado

In [21]:
# Agrupamiento de df por rating y luego por año ascendentemente
df_ordenado = df.sort_values(by=['rating','año'], ascending=[False, True])
df_ordenado

       titulo   año  rating
2  Pelicula C  2005     8.1
3  Pelicula D  2010     7.5
0  Pelicula A  2001     7.2
1  Pelicula B  2000     6.5

* Ordenar y Agrupar DataFrames en Pandas 3

Crea un nuevo DataFrame a partir del siguiente diccionario

    datos = {
        'titulo': ['Pelicula A', 'Pelicula B', 'Pelicula C', 'Pelicula D', 'Pelicula E'],
        'género': ['Acción', 'Drama', 'Acción', 'Comedia', 'Drama'],
        'rating': [7.2, 8.5, 9.1, 6.5, 7.8]
    }

Que contiene datos de películas incluyendo su género.

Luego, agrupa las películas por 'género' y calcula el promedio de 'rating' para cada género.  Asegurate de almacenar el grupo y promedio en una variable llamada: promedio_rating_por_genero

In [25]:
datos = {
    'titulo': ['Pelicula A', 'Pelicula B', 'Pelicula C', 'Pelicula D', 'Pelicula E'],
    'género': ['Acción', 'Drama', 'Acción', 'Comedia', 'Drama'],
    'rating': [7.2, 8.5, 9.1, 6.5, 7.8]
}

df = pd.DataFrame(datos)
promedio_rating_por_genero = df.groupby('género')['rating'].mean()
promedio_rating_por_genero

género
Acción     8.15
Comedia    6.50
Drama      8.15
Name: rating, dtype: float64

## Fusión de DataFrames

merge, joins

# Merge --> Fusionar
import pandas as pd
df_combinado = pd.merge(df1, df2, on='id')


how --> Para manejar qué queda afuera y qué no

inner interno

outer externos (rellena los faltantes con NaN)

left right (rellena los faltantes con los valores de la columna de la izquierda o derecha)

## Opción que permite unir todos los datos sin dejar nada afuera pero manteniendo los índices originales

left index
right index

* Fusionar DataFrames con merge 1

Tienes dos DataFrames, libros y autores, que necesitas fusionar.

Estos DataFrames se definen de la siguiente manera:

    libros = pd.DataFrame({
        'ID': [1, 2, 3, 4],
        'titulo': ['El Quijote', 'La Odisea', 'Cien Años de Soledad', 'El Principito']
    })
     
    autores = pd.DataFrame({
        'ID': [1, 2, 3, 5],
        'nombre': ['Miguel de Cervantes', 'Homero', 'Gabriel García Márquez', 'J.K. Rowling']
    })

El objetivo es fusionar libros con autores para obtener un DataFrame que contenga toda la información disponible, asociando cada libro con su autor correspondiente. Debes nombrar el DataFrame fusionado como: libros_autores

Utiliza el método de fusión adecuado para asegurar que no se pierda ningún libro o autor, incluso si no hay una correspondencia directa entre ellos. El resultado debe tener NaN donde no haya información disponible.

In [29]:
# how --> Para manejar qué queda afuera y qué no
# inner interno
# outer externos (rellena los faltantes con NaN)
# left right (rellena los faltantes con los valores de la columna de la izquierda o derecha)

# how --> Para manejar qué queda afuera y qué no
# inner interno
# outer externos (rellena los faltantes con  NaN)
# left right (rellena los faltantes con los valores de la columna de la izquierda o derecha)

libros = pd.DataFrame({
    'ID': [1, 2, 3, 4],
    'titulo': ['El Quijote', 'La Odisea', 'Cien Años de Soledad', 'El Principito']
})

autores = pd.DataFrame({
    'ID': [1, 2, 3, 5],
    'nombre': ['Miguel de Cervantes', 'Homero', 'Gabriel García Márquez', 'J.K. Rowling']
})

libros_autores = pd.merge(libros,autores, how='outer', on='ID')
libros_autores

   ID                titulo                  nombre
0   1            El Quijote     Miguel de Cervantes
1   2             La Odisea                  Homero
2   3  Cien Años de Soledad  Gabriel García Márquez
3   4         El Principito                     NaN
4   5                   NaN            J.K. Rowling

* Fusionar DataFrames con merge 2

Imagina que estás trabajando con dos conjuntos de datos: uno que contiene información sobre cursos en línea ofrecidos (cursos) y otro que contiene información sobre las inscripciones a estos cursos (inscripciones).

Los DataFrames se definen de la siguiente manera:

    cursos = pd.DataFrame({
        'curso_id': [101, 102, 103],
        'nombre_curso': ['Introducción a Python', 'Data Science con Python', 'Machine Learning Avanzado']
    })
     
    inscripciones = pd.DataFrame({
        'curso_id': [102, 102, 101, 104],
        'fecha_inscripcion': ['2023-01-15', '2023-02-01', '2023-01-20', '2023-03-05']
    })

Tu tarea es fusionar cursos con inscripciones (en un DataFrame llamado: cursos_inscripciones) de tal manera que el resultado final incluya todos los registros de inscripciones, completándolos con la información disponible en cursos.

Utiliza el método de fusión adecuado para garantizar que no se pierda ninguna inscripción, incluso si el curso correspondiente no está listado en el DataFrame cursos. Es importante que el DataFrame resultante cursos_inscripciones muestre claramente qué inscripciones no tienen un curso correspondiente, rellenando esos espacios con NaN.

In [30]:
cursos = pd.DataFrame({
    'curso_id': [101, 102, 103],
    'nombre_curso': ['Introducción a Python', 'Data Science con Python', 'Machine Learning Avanzado']
})
    
inscripciones = pd.DataFrame({
    'curso_id': [102, 102, 101, 104],
    'fecha_inscripcion': ['2023-01-15', '2023-02-01', '2023-01-20', '2023-03-05']
})

cursos_inscripciones = pd.merge(cursos, inscripciones, on='curso_id', how='left')
cursos_inscripciones

   curso_id               nombre_curso fecha_inscripcion
0       101      Introducción a Python        2023-01-20
1       102    Data Science con Python        2023-01-15
2       102    Data Science con Python        2023-02-01
3       103  Machine Learning Avanzado               NaN

Fusionar DataFrames con merge 3

Dispones de dos DataFrames, productos y reviews, que contienen información sobre productos y las reseñas asociadas a estos productos, respectivamente. Los DataFrames se presentan de la siguiente manera:

    productos = pd.DataFrame({
        'ID': [10, 11, 12],
        'Nombre': ['Teclado', 'Mouse', 'Monitor'],
        'Marca': ['Logitech', 'Razer', 'Dell']
    })
     
    reviews = pd.DataFrame({
        'ID': [10, 11, 12],
        'Calificación': [5, 4, 4],
        'Comentario': ['Excelente producto', 'Buen producto', 'Satisfecho']
    })

Tu tarea consiste en fusionar productos con reviews para obtener un DataFrame que combine la información de ambos (al cual debes nombrar: productos_reviews), manteniendo los índices originales de cada uno.

Utiliza los parámetros adecuados de la función merge() para realizar esta combinación. El DataFrame resultante productos_reviews debe contener las columnas de ambos DataFrames originales, permitiendo así un análisis detallado de cada producto junto con sus reseñas.

In [36]:
productos = pd.DataFrame({
    'ID': [10, 11, 12],
    'Nombre': ['Teclado', 'Mouse', 'Monitor'],
    'Marca': ['Logitech', 'Razer', 'Dell']
})
    
reviews = pd.DataFrame({
    'ID': [10, 11, 12],
    'Calificación': [5, 4, 4],
    'Comentario': ['Excelente producto', 'Buen producto', 'Satisfecho']
})

productos_reviews = pd.merge(productos,reviews,left_index=True,right_index=True,how='outer')

productos_reviews

   ID_x   Nombre     Marca  ID_y  Calificación          Comentario
0    10  Teclado  Logitech    10             5  Excelente producto
1    11    Mouse     Razer    11             4       Buen producto
2    12  Monitor      Dell    12             4          Satisfecho

## Combinar

Por defecto el join trae el argumento jow como left.

* Combinar DataFrames en Pandas con join() 1

Dados dos DataFrames, df_a y df_b. 

    # Creación del DataFrame df_a
    df_a = pd.DataFrame({
        'id': [1, 2, 3],
        'Nombre': ['Ana', 'Beto', 'Carla']
    })
    df_a.set_index('id', inplace=True)
     
    # Creación del DataFrame df_b
    df_b = pd.DataFrame({
        'id': [1, 2, 3],
        'Edad': [25, 30, 35]
    })
    df_b.set_index('id', inplace=True)

Utiliza el método join() para combinar df_a y df_b en un nuevo DataFrame llamado df_combinado, usando el argumento por defecto de how.

In [41]:
# Creación del DataFrame df_a
df_a = pd.DataFrame({
    'id': [1, 2, 3],
    'Nombre': ['Ana', 'Beto', 'Carla']
})
df_a.set_index('id', inplace=True)
df_a
    
# Creación del DataFrame df_b
df_b = pd.DataFrame({
    'id': [1, 2, 3],
    'Edad': [25, 30, 35]
})
df_b.set_index('id', inplace=True)

# Combinar los Dataframes
df_combinado = df_a.join(df_b)
df_combinado

   Nombre  Edad
id
1     Ana    25
2    Beto    30
3   Carla    35

* Combinar DataFrames en Pandas con join() 2

Dado el DataFrame productos_df con columnas ProductoID, Nombre y Precio, y el DataFrame categorias_df con columnas CategoriaID y NombreCategoria


    # Creamos los DataFrames de ejemplo
    productos_df = pd.DataFrame({
        'ProductoID': [1, 2, 3, 4],
        'Nombre': ['Producto 1', 'Producto 2', 'Producto 3', 'Producto 4'],
        'Precio': [100, 150, 200, 250]
    }).set_index('ProductoID')
     
    categorias_df = pd.DataFrame({
        'CategoriaID': [1, 2],
        'NombreCategoria': ['Categoría 1', 'Categoría 2']
    }).set_index('CategoriaID')


Donde ambos DataFrames están indexados por ProductoID y CategoriaID respectivamente, realiza una unión usando el método join() para combinar estos DataFrames en un nuevo DataFrames  nombrado: df_combinado basándote en sus índices, asegurándote de que todos los productos se muestren, independientemente de si tienen una categoría asignada o no.

Utiliza el método adecuado  para asegurar que todos los registros del DataFrame de la izquierda (productos_df en este caso) se incluyan en el DataFrame resultante df_combinado, independientemente de si tienen una correspondencia en el DataFrame de la derecha (categorias_df).

In [43]:
# Creamos los DataFrames de ejemplo
productos_df = pd.DataFrame({
    'ProductoID': [1, 2, 3, 4],
    'Nombre': ['Producto 1', 'Producto 2', 'Producto 3', 'Producto 4'],
    'Precio': [100, 150, 200, 250]
}).set_index('ProductoID')
    
categorias_df = pd.DataFrame({
    'CategoriaID': [1, 2],
    'NombreCategoria': ['Categoría 1', 'Categoría 2']
}).set_index('CategoriaID')

df_combinado = productos_df.join(categorias_df, how='left')
df_combinado

                Nombre  Precio NombreCategoria
ProductoID
1           Producto 1     100     Categoría 1
2           Producto 2     150     Categoría 2
3           Producto 3     200             NaN
4           Producto 4     250             NaN

* Combinar DataFrames en Pandas con join() 3

Combinar DataFrames en Pandas con join() 3

En este ejercicio, trabajarás con dos DataFrames: productos_df y categorias_df.

    productos_df = pd.DataFrame({
        'ProductoID': [1, 2, 3, 4],
        'Nombre': ['Producto 1', 'Producto 2', 'Producto 3', 'Producto 4'],
        'Precio': [100, 150, 200, 250]
    })
     
    productos_df = productos_df.set_index('ProductoID')
     
    categorias_df = pd.DataFrame({
        'CategoriaID': [1, 2, 3],
        'NombreCategoria': ['Categoría 1', 'Categoría 2', 'Categoría 3']
    }).set_index('CategoriaID')

Tu tarea es combinar estos DataFrames en un DataFrame llamado df_combinado de tal manera que se conserven todos los registros del DataFrame de productos_df, incluso si no tienen una categoría correspondiente en categorias_df. Para esto, debes utilizar el parámetro how="right" en el método join().

Instrucciones:

    Combina los DataFrames productos_df y categorias_df utilizando el método join() y el parámetro how="right".

    Asigna el resultado a un DataFrame llamado df_combinado.

In [45]:
productos_df = pd.DataFrame({
    'ProductoID': [1, 2, 3, 4],
    'Nombre': ['Producto 1', 'Producto 2', 'Producto 3', 'Producto 4'],
    'Precio': [100, 150, 200, 250]
})
    
productos_df = productos_df.set_index('ProductoID')
    
categorias_df = pd.DataFrame({
    'CategoriaID': [1, 2, 3],
    'NombreCategoria': ['Categoría 1', 'Categoría 2', 'Categoría 3']
}).set_index('CategoriaID')

df_combinado = productos_df.join(categorias_df, how='right')
df_combinado

                 Nombre  Precio NombreCategoria
CategoriaID
1            Producto 1     100     Categoría 1
2            Producto 2     150     Categoría 2
3            Producto 3     200     Categoría 3

* Concatenar DataFrames en Pandas con concat 1

Tienes dos conjuntos de datos representados por los siguientes DataFrames ventas_enero y ventas_febrero, que contienen las ventas de diferentes productos en los meses de enero y febrero, respectivamente.

    ventas_enero = pd.DataFrame({'Producto': ["Manzanas", "Bananas", "Naranjas"], 'Cantidad': [300, 200, 150]})
    ventas_febrero = pd.DataFrame({'Producto': ["Manzanas", "Bananas", "Naranjas"], 'Cantidad': [350, 210, 170]})

Tu tarea es utilizar el método concat() para concatenar estos dos DataFrames verticalmente en un nuevo DataFrame llamado ventas_total. Asegúrate de ignorar los índices originales para que el índice del DataFrame resultante sea continuo.

In [53]:
ventas_enero = pd.DataFrame({'Producto': ["Manzanas", "Bananas", "Naranjas"], 'Cantidad': [300, 200, 150]})
ventas_febrero = pd.DataFrame({'Producto': ["Manzanas", "Bananas", "Naranjas"], 'Cantidad': [350, 210, 170]})

# Por defecto lo concatena vertical por el parámetro implícito Axis que viene en 0.
df_concatenado = pd.concat([ventas_enero, ventas_febrero], ignore_index=True)
df_concatenado

   Producto  Cantidad
0  Manzanas       300
1   Bananas       200
2  Naranjas       150
3  Manzanas       350
4   Bananas       210
5  Naranjas       170

In [49]:
# Si cambiamos Axis a 1:
df_concatenado1 = pd.concat([ventas_enero, ventas_febrero], axis=1)
df_concatenado1

   Producto  Cantidad  Producto  Cantidad
0  Manzanas       300  Manzanas       350
1   Bananas       200   Bananas       210
2  Naranjas       150  Naranjas       170

In [52]:
# Si queremos que el índice se incremente:
df_concatenado3= pd.concat([ventas_enero, ventas_febrero], ignore_index=True)
df_concatenado3

   Producto  Cantidad
0  Manzanas       300
1   Bananas       200
2  Naranjas       150
3  Manzanas       350
4   Bananas       210
5  Naranjas       170

In [ ]:
# Agregar marcas para saber de qué grupo son:
df_concatenado4 = pd.concat([ventas_enero, ventas_febrero], keys=['ventas_enero','ventas_febrero'])
df_concatenado4

* Concatenar DataFrames en Pandas con concat 2

Considera los siguientes DataFrames datos_cliente y compras_cliente, que contienen información sobre los clientes y sus compras, respectivamente.

    datos_cliente = pd.DataFrame({'Nombre': ["Ana", "Luis", "Marta"], 'Edad': [34, 45, 28]})
    compras_cliente = pd.DataFrame({'Producto': ["Libro", "Lápiz", "Cuaderno"], 'Precio': [15.50, 0.50, 2.00]})

Utiliza el método concat() para unir estos dos DataFrames horizontalmente, formando un nuevo DataFrame llamado info_cliente. Asegúrate de que los índices se mantengan para que cada fila corresponda correctamente entre los dos DataFrames.

In [54]:
datos_cliente = pd.DataFrame({'Nombre': ["Ana", "Luis", "Marta"], 'Edad': [34, 45, 28]})
compras_cliente = pd.DataFrame({'Producto': ["Libro", "Lápiz", "Cuaderno"], 'Precio': [15.50, 0.50, 2.00]})

info_cliente = pd.concat([datos_cliente, compras_cliente], axis=1)
info_cliente

  Nombre  Edad  Producto  Precio
0    Ana    34     Libro    15.5
1   Luis    45     Lápiz     0.5
2  Marta    28  Cuaderno     2.0

* Concatenar DataFrames en Pandas con concat 3

Dado los siguientes DataFrames que representan las ventas de dos tiendas diferentes en el mismo mes:

    tienda_a = pd.DataFrame({'Producto': ["Manzanas", "Bananas"], 'Cantidad': [500, 300]})
    tienda_b = pd.DataFrame({'Producto': ["Naranjas", "Peras"], 'Cantidad': [400, 250]})

Tu tarea es concatenar estos DataFrames verticalmente en un nuevo DataFrame llamado ventas_tienda, utilizando el parámetro keys para marcar cada bloque de datos con las etiquetas "Tienda A" y "Tienda B", respectivamente. Asegúrate de que el DataFrame resultante tenga un índice jerárquico que refleje estas claves.


Observación:

En estos ejercicios no tendrás el botón "Ejecutar código" por esta razón no podrás visualizar los datos generados. Si deseas visualizarlos podrás servirte de un cuaderno de Jupyter y luego probar el ejercicio con ayuda del botón: "Ejecutar pruebas"

In [60]:
tienda_a = pd.DataFrame({'Producto': ["Manzanas", "Bananas"], 'Cantidad': [500, 300]})
tienda_b = pd.DataFrame({'Producto': ["Naranjas", "Peras"], 'Cantidad': [400, 250]})

ventas_tienda = pd.concat([tienda_a,tienda_b],keys=['Tienda A','Tienda B'])
ventas_tienda

            Producto  Cantidad
Tienda A 0  Manzanas       500
         1   Bananas       300
Tienda B 0  Naranjas       400
         1     Peras       250

## Datos relacionados con el Tiempo

* Datos Relacionados con el Tiempo en Pandas 1

Crea una serie temporal que represente todos los días desde el inicio del año 2024 hasta el septimo dia del mismo mes y año. Usa el método adecuado para generar esta serie y asígnala a una variable llamada primera_semana_2024

In [103]:
primera_semana_2024 = pd.Series(pd.date_range('20240101', periods=7, freq='D'))
primera_semana_2024

0   2024-01-01
1   2024-01-02
2   2024-01-03
3   2024-01-04
4   2024-01-05
5   2024-01-06
6   2024-01-07
dtype: datetime64[ns]

In [76]:
# fechas = pd.Series(pd.date_range(start='2022-01-01', end='2022-12-31', periodos=6, freq='D'))
fechas = pd.Series(pd.date_range('20240101', periods=6))
fechas

0   2024-01-01
1   2024-01-02
2   2024-01-03
3   2024-01-04
4   2024-01-05
5   2024-01-06
dtype: datetime64[ns]

In [77]:
fechas = pd.Series(pd.date_range('20240101', periods=6, freq='ME'))
fechas

0   2024-01-31
1   2024-02-29
2   2024-03-31
3   2024-04-30
4   2024-05-31
5   2024-06-30
dtype: datetime64[ns]

In [78]:
fechas = pd.Series(pd.date_range('20240101', periods=6, freq='YE'))
fechas

0   2024-12-31
1   2025-12-31
2   2026-12-31
3   2027-12-31
4   2028-12-31
5   2029-12-31
dtype: datetime64[ns]

In [79]:
fechas = pd.Series(pd.date_range('20240101', periods=6, freq='h'))
fechas

0   2024-01-01 00:00:00
1   2024-01-01 01:00:00
2   2024-01-01 02:00:00
3   2024-01-01 03:00:00
4   2024-01-01 04:00:00
5   2024-01-01 05:00:00
dtype: datetime64[ns]

In [80]:
fechas = pd.Series(pd.date_range('20240101', periods=6, freq='5D'))
fechas

0   2024-01-01
1   2024-01-06
2   2024-01-11
3   2024-01-16
4   2024-01-21
5   2024-01-26
dtype: datetime64[ns]

In [86]:
ruta="C:\\AmaruAyelen\\proyectos\\PythonDataScienceMachineLearning\\PythonDataScienceMachineLearning\\Files\\Mercado+de+Valores+España.csv"
df = pd.read_csv(ruta)
df

,Ticker,Fecha,Cierre,Referencia,Volumen,Rotacion,Ultimo,Alto,Bajo,Promedio
0,ANA,02/01/2019,74.80,73.90,156300,11621188.98,74.80,75.16,72.38,74.3518
1,ANA,03/01/2019,76.34,74.80,140331,10632703.64,76.34,76.60,74.54,75.7687
2,ANA,04/01/2019,76.62,76.34,130309,10010838.76,76.62,77.40,76.40,76.8162
3,ANA,07/01/2019,77.14,76.62,63349,4855724.92,77.14,77.30,75.62,76.6504
4,ANA,08/01/2019,78.24,77.14,99300,7749464.70,78.24,78.46,77.00,78.0409
...,...,...,...,...,...,...,...,...,...,...
8570,VIS,09/12/2019,48.70,48.76,40236,1958325.66,48.70,48.96,48.44,48.6710
8571,VIS,10/12/2019,48.16,48.70,60198,2895965.78,48.16,48.74,47.70,48.1201
8572,VIS,11/12/2019,47.96,48.16,63000,3012462.12,47.96,48.42,47.52,47.8169
8573,VIS,12/12/2019,48.42,47.96,50218,2429199.80,48.42,48.66,47.76,48.3731
8574,VIS,13/12/2019,48.64,48.42,62427,3038685.10,48.64,49.18,48.12,48.6758

In [114]:
# Convertir a fecha:
# df['fecha'] = pd.to_datetime(df['Fecha'], format='%d/%m/%Y')
df['fecha'] = pd.to_datetime(df['fecha']).dt.strftime('%d/%m/%Y')
df

,Ticker,Fecha,Cierre,Referencia,Volumen,Rotacion,Ultimo,Alto,Bajo,Promedio,fecha,fecha2
0,ANA,2019-01-02,74.80,73.90,156300,11621188.98,74.80,75.16,72.38,74.3518,02/01/2019,2019-01-02
1,ANA,2019-01-03,76.34,74.80,140331,10632703.64,76.34,76.60,74.54,75.7687,03/01/2019,2019-01-03
2,ANA,2019-01-04,76.62,76.34,130309,10010838.76,76.62,77.40,76.40,76.8162,04/01/2019,2019-01-04
3,ANA,2019-01-07,77.14,76.62,63349,4855724.92,77.14,77.30,75.62,76.6504,07/01/2019,2019-01-07
4,ANA,2019-01-08,78.24,77.14,99300,7749464.70,78.24,78.46,77.00,78.0409,08/01/2019,2019-01-08
...,...,...,...,...,...,...,...,...,...,...,...,...
8570,VIS,2019-12-09,48.70,48.76,40236,1958325.66,48.70,48.96,48.44,48.6710,09/12/2019,2019-12-09
8571,VIS,2019-12-10,48.16,48.70,60198,2895965.78,48.16,48.74,47.70,48.1201,10/12/2019,2019-12-10
8572,VIS,2019-12-11,47.96,48.16,63000,3012462.12,47.96,48.42,47.52,47.8169,11/12/2019,2019-12-11
8573,VIS,2019-12-12,48.42,47.96,50218,2429199.80,48.42,48.66,47.76,48.3731,12/12/2019,2019-12-12
8574,VIS,2019-12-13,48.64,48.42,62427,3038685.10,48.64,49.18,48.12,48.6758,13/12/2019,2019-12-13

In [97]:
type(df['Fecha'][0])

pandas._libs.tslibs.timestamps.Timestamp

In [101]:
# Extraer información más específica
print(df['Fecha'][44])
print(df['Fecha'][44].year)
print(df['Fecha'][44].month)

# Se agregaron 5 días
df_mas_5_dias=df['Fecha']+pd.Timedelta(days=5)
df_mas_5_dias

2019-03-05 00:00:00
2019
3

0      2019-01-07
1      2019-01-08
2      2019-01-09
3      2019-01-12
4      2019-01-13
          ...
8570   2019-12-14
8571   2019-12-15
8572   2019-12-16
8573   2019-12-17
8574   2019-12-18
Name: Fecha, Length: 8575, dtype: datetime64[ns]

* Datos Relacionados con el Tiempo en Pandas 2

Dada una lista de fechas en formato string ['2024-01-01', '2024-02-14', '2024-03-01'] en una columna fecha de una tabla llamada fechas.csv

Debes leer el archivo CSV 'fechas.csv' desde tu código para ello emplea el método adecuado.

Convierte estas fechas al formato datetime de Pandas con el siguiente formato dia/mes/año. Almacena este DataFrame en una variable nombrada df

* Datos Relacionados con el Tiempo en Pandas 3

Dada una lista de fechas en formato string ['01-01-2024', '14-02-2024', '01-03-2024'] en una columna fecha de una tabla llamada fechas.csv

Debes leer el archivo CSV 'fechas.csv' desde tu código para ello emplea el método adecuado.

Convierte estas fechas al formato datetime de Pandas. Con el siguiente formato dia/mes/año. Almacena este DataFrame en una variable nombrada df

Agrega cinco días a cada fecha.